# Brewfile generated from current brew installation
# Use 'brew bundle' to install all dependencies

# Development Tools
brew "git"
brew "git-crypt"
brew "go"
brew "ruby"
brew "python@3.10"
brew "python@3.13"

# Cloud & Infrastructure Tools
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "helm"
brew "helm-ls"
brew "kubernetes-cli"
brew "argocd"
brew "tilt"
brew "opentofu"

# System Utilities
brew "tree"
brew "wget"
brew "whois"
brew "telnet"
brew "speedtest-cli"
brew "speedtest"
brew "mtr"
brew "nmap"
brew "iftop"
brew "iperf3"
brew "tcptraceroute"
brew "jq"

# Security & Encryption
brew "gnupg"
brew "pinentry"

# Media & Graphics Libraries
brew "ffmpeg"
brew "tesseract"

# Core Libraries & Dependencies
brew "aom"
brew "aribb24"
brew "brotli"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cffi"
brew "cjson"
brew "cryptography"
brew "dav1d"
brew "flac"
brew "fontconfig"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "gdbm"
brew "gettext"
brew "giflib"
brew "glib"
brew "gmp"
brew "gnutls"
brew "graphite2"
brew "harfbuzz"
brew "highway"
brew "icu4c@76"
brew "icu4c@77"
brew "imath"
brew "jansson"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libb2"
brew "libbluray"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgpg-error"
brew "libidn2"
brew "libksba"
brew "liblinear"
brew "libmicrohttpd"
brew "libnet"
brew "libnghttp2"
brew "libogg"
brew "libpng"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "little-cms2"
brew "lua"
brew "lz4"
brew "lzo"
brew "mbedtls"
brew "mpdecimal"
brew "mpg123"
brew "nettle"
brew "npth"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjpeg"
brew "openssl@1.1"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre2"
brew "pixman"
brew "pycparser"
brew "python-certifi"
brew "python-cryptography"
brew "python-packaging"
brew "rav1e"
brew "readline"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "sqlite"
brew "srt"
brew "svt-av1"
brew "theora"
brew "unbound"
brew "webp"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "zeromq"
brew "zimg"
brew "zstd"

# GUI Applications (Casks)
cask "espanso"
cask "ghostty"
cask "klogg"
cask "vagrant"
cask "virtualbox"
